**Pandas => Used for data analysis and pre processing with the help of numpy(written in c) for speed**

In [2]:
import numpy as np
import pandas as pd

In [34]:
my_dict = {
    "name" : ["Sampanna","Sumit","Suresh","Prabhas","Anantha"],
    "age"  : [23,33,29,15,18],
    "marks": [79.9,18.8,36.6,14.4,55.5]
}

In [35]:
df = pd.DataFrame(my_dict)#creates dataframe from given dictionary(dictionary should be as shown)
print(df)
df

       name  age  marks
0  Sampanna   23   79.9
1     Sumit   33   18.8
2    Suresh   29   36.6
3   Prabhas   15   14.4
4   Anantha   18   55.5

       name  age  marks
0  Sampanna   23   79.9
1     Sumit   33   18.8
2    Suresh   29   36.6
3   Prabhas   15   14.4
4   Anantha   18   55.5

In [5]:
df.to_csv("DictToCSV.csv")#converts the data frame into csv with index 0,1,... in first column

In [6]:
df.to_csv("DictToCSV_NoIndex.csv",index=False)#index won't be shown

In [19]:
df.dtypes

name      object
age        int64
marks    float64
dtype: object

In [20]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
df.head(2)#shows first 2 entries

       name  age  marks
0  Sampanna   23   79.9
1     Sumit   33   18.8

In [8]:
df.tail(3)#shows last 3 entries

      name  age  marks
2   Suresh   29   36.6
3  Prabhas   15   14.4
4  Anantha   18   55.5

In [9]:
df.describe()#shows all the statistical data

            age      marks
count   5.00000   5.000000
mean   23.60000  41.040000
std     7.46994  27.125689
min    15.00000  14.400000
25%    18.00000  18.800000
50%    23.00000  36.600000
75%    29.00000  55.500000
max    33.00000  79.900000

In [21]:
df.to_numpy()#converts to numpy array

array([['Sampanna', 23, 79.9],
       ['Sumit', 33, 18.8],
       ['Suresh', 29, 36.6],
       ['Prabhas', 15, 14.4],
       ['Anantha', 18, 55.5]], dtype=object)

In [24]:
df.T

              0      1       2        3        4
name   Sampanna  Sumit  Suresh  Prabhas  Anantha
age          23     33      29       15       18
marks      79.9   18.8    36.6     14.4     55.5

In [27]:
df.sort_index(axis=0,ascending=False)#sorting the rows in descending order
#df.sort_index(axis=1,ascending=False)=>sorting the cols in descending order

       name  age  marks
4   Anantha   18   55.5
3   Prabhas   15   14.4
2    Suresh   29   36.6
1     Sumit   33   18.8
0  Sampanna   23   79.9

In [28]:
refDf = df#refDf is like pass by reference i.e. any change done in refDf will change df

In [29]:
copyDf = df.copy()#copyDf is like copy the vlaues i.e. change done in copyDf will be independent of change done to df

In [45]:
print(df)
df.loc[1,"name"] = "Shreya"
df

       name  age  marks
0  Sampanna   23   79.9
1     Sumit   33   18.8
2    Suresh   29   36.6
3   Prabhas   15   14.4
4   Anantha   18   55.5

       name  age  marks
0  Sampanna   23   79.9
1    Shreya   33   18.8
2    Suresh   29   36.6
3   Prabhas   15   14.4
4   Anantha   18   55.5

In [47]:
table = pd.read_csv("newFile.csv")#Displays the csv file which is present already
print(table,end="\n\n")
print(table['heading1'],end="\n\n")#displays all the data within column under heading1
print(table['heading2'],end="\n\n")#displays all the data within column under heading2

print(table['heading1'][2])#or print(table.loc[2,"heading1"])
table['heading1'][3] = "Changed"
table.index = ["one","two","three","four","five","six","seven"]#changing the index value to "one","two",..."seven"
table.to_csv('newFileModified.csv')#All the modification done is saved in newFileModified.csv

  heading1 heading2
0   data1A   data1B
1   data2A   data2B
2   data3A   data3B
3   data4A   data4B
4   data5A   data5B
5   data6A   data6B
6   data7A  data7B

0    data1A
1    data2A
2    data3A
3    data4A
4    data5A
5    data6A
6    data7A
Name: heading1, dtype: object

0     data1B
1     data2B
2     data3B
3     data4B
4     data5B
5     data6B
6    data7B
Name: heading2, dtype: object

data3A
data3A

In [68]:
#df.columns = [0,1,2]#Changes column names to 0,1,2
df.loc[1,4] = "something"
df = df.drop(4,axis=1)#deleting column with 4 as it's name
df

          0   1     2
0  Sampanna  23  79.9
1     Sumit  33  18.8
2    Suresh  29  36.6
3   Prabhas  15  14.4
4   Anantha  18  55.5

In [71]:
df.loc[[0,2,4],[1,0]] # 1st arg shows rows 0,2,4 and 2nd arg shows cols 1,0

    1         0
0  23  Sampanna
2  29    Suresh
4  18   Anantha

In [72]:
df.loc[:,[1,2]]#All the rows and columns {1,2}

    1     2
0  23  79.9
1  33  18.8
2  29  36.6
3  15  14.4
4  18  55.5

In [73]:
df.loc[[1,2,4],:]#All the cols and rows {1,2,4}

         0   1     2
1    Sumit  33  18.8
2   Suresh  29  36.6
4  Anantha  18  55.5

In [14]:
df.loc[(df["age"]>20)]#Displays only those entries whose age value is greater than 20

       name  age  marks
0  Sampanna   23   79.9
1     Sumit   33   18.8
2    Suresh   29   36.6

In [15]:
df.loc[(df["age"]>20) & (df["marks"]>25)] #added extra condition

       name  age  marks
0  Sampanna   23   79.9
2    Suresh   29   36.6

In [16]:
print(df.iloc[0,2])#Used when indexed with index values

79.9

In [27]:
df.iloc[0,0]

'Sampanna'

In [33]:
#df.drop([1,3],axis=0,inplace=True)
df.reset_index(drop=True,inplace=True)#resets the index value if a row is deleted & inplace basically does df=df.reset_index(..)
df

       name  age  marks
0  Sampanna   23   79.9
1    Suresh   29   36.6
2   Anantha   18   55.5

In [40]:
df['newCol'] = 10#Creates a new col with value 10
df

       name  age  marks  newCol
0  Sampanna   23   79.9      10
1     Sumit   33   18.8      10
2    Suresh   29   36.6      10
3   Prabhas   15   14.4      10
4   Anantha   18   55.5      10

In [42]:
df.shape

(5, 4)

In [ ]:
#for using excel files use => pip install xlrd